{
  "users": [
    {
      "id": 1,
      "title": "json-server",
      "author": "typicode"
    }
  ],
  "products": [
    {
      "id": 1,
      "name": "Máy tính bảng iPad Pro M1 12.9 inch WiFi Cellular 128GB (2021)",
      "originalPrice": 34990000,
      "image": "http://res.cloudinary.com/dv3vzmogk/image/upload/v1658556933/anhhtus/yy6ejqt6kjhsugkpb97c.jpg",
      "saleOffPrice": 29290000,
      "category": "Máy tính bảng",
      "feature": "aaaaaaaaaaaa",
      "description": "<div>\n<p>Màn hình Liquid Retina XDR 12.9 inch rực rỡ</p>\n<p>iPad Pro M1 12.9 inch 2021 sở hữu màn hình Liquid Retina XDR, áp dụng công nghệ mini-LED với 10.000 bóng được tuỳ chỉnh nhỏ hơn 120 lần so với thế hệ trước nên độ sáng có thể lên đến 1600 nits ngay cả ngoài trời vẫn có thể sử dụng tốt.\n</p>\n<img src=\"https://cdn.tgdd.vn/Products/Images/522/238649/ipad-pro-m1-12-9-inch-wifi-cellular-128gb-2021-3.jpg\" alt=\"\">\n<p>Màn hình có kích thước 12.9 inch cung cấp chế độ xem mở rộng hơn, trải nghiệm HDR tuyệt đẹp trên màn hình rõ ràng giúp cho mọi hoạt động, thao tác trên máy thêm cuốn hút và đắm chìm theo thời gian.</p>\n<img src=\"https://cdn.tgdd.vn/Products/Images/522/238649/ipad-pro-m1-129-inch-08.jpg\" alt=\"\">\n<p>Mọi chi tiết hiển thị trên màn hình sống động như thật với tỷ lệ tương phản 1.000.000: 1 cùng các công nghệ tiên tiến như P3 wide color, True Tone và ProMotion giúp iPad Pro 12.9 inch 2021 tỏa sáng ngoạn mục.</p>\n<img src=\"https://cdn.tgdd.vn/Products/Images/522/238649/ipad-pro-m1-129-inch-01.jpg\" alt=\"\">\n<p>Tận hưởng iPad Pro 12.9 inch 2021 128GB như một chiếc laptop với sự hỗ trợ của các phụ kiện chuyên nghiệp như bàn phím, bút Apple Pencil hay các bộ điều khiển chơi game hiện đại,... Những phụ kiện đa năng này được thiết kế để đưa công việc, sự sáng tạo và những giờ phút giải trí của bạn lên một tầm cao mới.</p>\n<img src=\"https://cdn.tgdd.vn/Products/Images/522/238649/ipad-pro-m1-12-9-inch-wifi-cellular-128gb-2021-24.jpg\" alt=\"\">\n<p>Lưu ý: Các phụ kiện như bàn phím, bút Apple Pencil sẽ không đi kèm trong hộp máy.</p>\n    </div>",
      "shortDescription": "<p>Bạn có đang mong chờ những sản phẩm chất lượng đến từ Apple?\nSau hàng loạt các sản phẩm đình đám như iPhone 12 series thì hãng \nđã tung ra chiếc iPad Pro M1 12.9 inch Wifi Cellular 128GB (2021) \ntrang bị những tính năng ngày càng vượt trội và thời thượng.</p>",
      "isHidden": false
    },
    {
      "id": 2,
      "name": "Tai nghe chụp tai Bluetooth AirPods Max Apple MGYH3 ",
      "originalPrice": 13990000,
      "image": "http://res.cloudinary.com/dv3vzmogk/image/upload/v1658415851/anhhtus/kyo9bu9d60sz6ln4ods2.jpg",
      "saleOffPrice": 12590000,
      "category": "Âm thanh",
      "feature": "<div><ul><li>Thiết kế sang trọng với chất liệu kim loại sáng bóng, bền bỉ.</li><li>Sử dụng chip H1 Apple cho kết nối nhanh chóng, kết nối không dây qua Bluetooth 5.0.</li><li>Tích hợp công nghệ chống ồn ANC, âm thanh xuyên âm (Transperency Mode).</li><li>Hỗ trợ Spatial Audio giúp tạo hiệu ứng âm thanh vòm khi xem phim và trải nghiệm nội dung Dolby Atmos được tốt hơn.</li><li>Digital Crown điều chỉnh linh hoạt, nhạy bén.</li><li>Tích hợp trợ lý ảo Siri điều khiển thêm tiện lợi.</li><li>Nghe nhận cuộc gọi trực tiếp từ tai nghe.</li><li>Thời gian sử dụng 20 giờ khi sử dụng chống ồn ANC và Transparency Mode.</li><li>Sạc nhanh 5 phút có thể sử dụng được 1.5 giờ.</li><li>Lưu ý: Thanh toán trước khi mở seal.</li></ul></div>",
      "description": "<div><p>Tai Bluetooth AirPods Max Apple MGYH3/ MGYJ3/ MGYL3 dễ dàng cuốn hút bạn ngay từ cái nhìn đầu tiên, với nét sang trọng và cực kỳ tinh tế đến từ sự tối giản trong thiết kế và màu sắc, tạo sự khác biệt ấn tượng với các sản phẩm tai nghe hiện có trên thị trường.</p><img src=\"https://cdn.tgdd.vn/Products/Images/54/236331/bluetooth-airpods-max-apple1.jpg\" alt=\"\"><p>Phần chụp tai bọc vải êm ái đính hút nam châm với củ tai dễ tháo rời vệ sinh. Bạn sẽ bất ngờ vì sự êm ái và rất nhẹ nhàng, thoải mái khi mang chiếc tai nghe trên đầu, trái với cảm nhận độ nặng ban đầu khi cầm trên tay.</p><img src=\"https://cdn.tgdd.vn/Products/Images/54/236331/bluetooth-airpods-max-apple2.jpg\" alt=\"\"><p>Đối xứng theo đó là nút chuyển đổi giữa ANC và Transperency Mode, nhấn để chuyển đổi đơn giản.</p><img src=\"https://cdn.tgdd.vn/Products/Images/54/236331/bluetooth-airpods-max-apple9.jpg\" alt=\"\"><p>Kết nối không dây Bluetooth 5.0 nhanh nhạy, đường truyền ổn định ở khoảng cách xa đến 10 m</p><p>Kết nối không dây linh hoạt liên kết tai nghe Bluetooth với điện thoại, laptop, máy tính bảng… để bắt đầu thưởng thức những bản nhạc yêu thích nhất trong kho âm nhạc của bạn.</p></div>\n",
      "shortDescription": "<div><p>Sang trọng với lớp vỏ kim loại sáng bóng, bền bỉ, lựa chọn dễ dàng theo sở thích cho 3 phiên bản màu xanh dương, bạc và xám </p></div>",
      "isHidden": false
    },
    {
      "id": 3,
      "name": "Laptop Apple MacBook Pro 16 M1 Max 2021 10 core-CPU/32GB/1TB SSD/32 core-GPU (MK1A3SA/A) ",
      "originalPrice": 90990000,
      "image": "http://res.cloudinary.com/dv3vzmogk/image/upload/v1658416793/anhhtus/mbxfdktufh3giliw0cwx.jpg",
      "saleOffPrice": 0,
      "category": "Laptop",
      "feature": "",
      "description": "<div><p>Hiệu năng vượt trội, đỉnh cao, cân mọi tác vụ</p><p>MacBook Pro 16 inch với những cải tiến vượt bậc về mặt hiệu năng, hứa hẹn giúp người dùng có trải nghiệm mượt mà trong các tác vụ nặng như chỉnh sửa hình ảnh phức tạp, render video,... hướng đến đối tượng người dùng có nhu cầu sản xuất, sáng tạo nội dung, kỹ thuật, côn nghệ chuyên nghiệp.</p><p>Con chip Apple M1 Max mang một sức mạnh siêu cấp với cấu trúc 10 nhân và tốc độ băng trong lên đến 400 GB/s memory bandwidth cho hiệu suất của Apple nhanh hơn khoảng 70% so với thế hệ tiền nhiệm Apple M1, từ đó mang lại cho bạn một tốc độ xử lý đáng kinh ngạc giúp giải quyết tốt từ các công việc văn phòng cơ bản đến phức tạp trên các phần mềm Office 365 cũng như đồ họa chuyên nghiệp trên Figma, Photoshop, AI, Pr, AutoCAD,...</p><p>Tích hợp với bộ CPU hiện đại trên là card đồ họa GPU 32 nhân cho hiệu suất nhanh hơn gấp 4 lần so với M1, năng cao khả năng xử lý đồ họa, thoả mãn niềm đam mê sáng tạo cho bạn, thiết kế 2D, 3D hiệu quả, render video tuyệt vời, đồng thời tiết kiệm điện năng đáng kể, thấp hơn 70% so với chip 8 nhân của PC/laptop.</p><p>Bộ nhớ RAM 32 GB đa nhiệm cực mượt mà, tăng tốc độ truy xuất dữ liệu, giảm thời gian chờ, mọi thao tác được phản hồi tức thời, bạn có thể dễ dàng mở nhiều phần mềm thiết kế để chỉnh sửa nhiều tệp hình ảnh phức tạp vừa render.</p><img src=\"https://cdn.tgdd.vn/Products/Images/44/253582/apple-macbook-pro-16-m1-max-2021-4-1.jpg\" alt=\"\"><p>Dung lượng khủng SSD 1 TB mang đến không gian bộ nhớ rộng rãi, thoải mái cho bạn lưu trữ tài liệu cá nhân, kho hình ảnh, video sáng tạo của bản thân và hàng loạt bộ phim hấp dẫn mà bạn yêu thích, đồng thời mở video 8K ngay lập tức hoặc lưu trữ hàng trăm ảnh RAW cùng một lúc.</p><img src=\"https://cdn.tgdd.vn/Products/Images/44/253582/apple-macbook-pro-16-m1-max-2021-5-3.jpg\" alt=\"\"><p>Hệ điều hành Mac OS giúp giao diện máy tính có độ thẩm mỹ cao, tạo cảm hứng làm việc ngay cho người dùng mỗi khi bật máy lên, tiện thao tác, dễ sử dụng và kho ứng dụng đồ sộ.</p><img src=\"https://cdn.tgdd.vn/Products/Images/44/253582/apple-macbook-pro-16-m1-max-2021-8.jpg\" alt=\"\"><p>Ngoài ra, hệ thống tản nhiệt tiên tiến chuyển lưu không khí nhiều hơn 50%, ngay cả ở tốc độ quạt thấp hơn giúp laptop luôn trong trạng thái mát mẻ, ổn định, hiệu quả làm việc cao cả khi hoạt động liên tục suốt ngày dài.</p></div>",
      "shortDescription": "<div><p>Thật ấn tượng với Apple MacBook Pro 16 M1 Max 2021 mang trên mình \"bộ áo mới\" độc đáo, cuốn hút mọi ánh nhìn cùng màn hình tai thỏ lần đầu tiên xuất hiện ở dòng Mac và ẩn bên trong là bộ cấu hình mạnh mẽ tuyệt vời đến từ con chip M1 Max tân tiến.</p></div>\n",
      "isHidden": true
    },
    {
      "id": 4,
      "name": "Điện thoại iPhone 13 Pro Max 128GB",
      "originalPrice": 33990000,
      "image": "http://res.cloudinary.com/dv3vzmogk/image/upload/v1658417096/anhhtus/pjpxl6v6b8c9tsz5sfsu.jpg",
      "saleOffPrice": 28190000,
      "category": "Điện thoại",
      "feature": "",
      "description": "<div><p>Thiết kế đẳng cấp hàng đầu</p><p>iPhone mới kế thừa thiết kế đặc trưng từ iPhone 12 Pro Max khi sở hữu khung viền vuông vức, mặt lưng kính cùng màn hình tai thỏ tràn viền nằm ở phía trước.</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/230529/iphone-13-pro-max-3.jpg\" alt=\"\"><p>Với iPhone 13 Pro Max phần tai thỏ đã được thu gọn lại 20% so với thế hệ trước, không chỉ giải phóng nhiều không gian hiển thị hơn mà còn giúp mặt trước chiếc điện thoại trở nên hấp dẫn hơn mà vẫn đảm bảo được hoạt động của các cảm biến.</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/230529/iphone-13-pro-max-2.jpg\" alt=\"\"><p>Điểm thay đổi dễ dàng nhận biết trên iPhone 13 Pro Max chính là kích thước của cảm biến camera sau được làm to hơn và để tăng độ nhận diện cho sản phẩm mới thì Apple cũng đã bổ sung một tùy chọn màu sắc Sierra Blue (màu xanh dương nhạt hơn so với Pacific Blue của iPhone 12 Pro Max).</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/230529/iphone-13-pro-max-9.jpg\" alt=\"\"><p>Máy vẫn tiếp tục sử dụng khung viền thép cao cấp cho khả năng chống trầy xước và va đập một cách vượt trội, kết hợp với khả năng kháng bụi, nước chuẩn IP68.</p></div>",
      "shortDescription": "<div><p>Điện thoại iPhone 13 Pro Max 128 GB - siêu phẩm được mong chờ nhất ở nửa cuối năm 2021 đến từ Apple. Máy có thiết kế không mấy đột phá khi so với người tiền nhiệm, bên trong đây vẫn là một sản phẩm có màn hình siêu đẹp, tần số quét được nâng cấp lên 120 Hz mượt mà, cảm biến camera có kích thước lớn hơn, cùng hiệu năng mạnh mẽ với sức mạnh đến từ Apple A15 Bionic, sẵn sàng cùng bạn chinh phục mọi thử thách.</p></div>",
      "isHidden": true
    },
    {
      "name": "Điện thoại iPhone Xs Max 64GB ",
      "originalPrice": 13890000,
      "image": "http://res.cloudinary.com/dv3vzmogk/image/upload/v1658417316/anhhtus/yvtyqlc6rtbhmecsucpr.png",
      "saleOffPrice": 11290000,
      "category": "Điện thoại",
      "feature": "",
      "description": "<div><p>Thiết kế cao cấp với viền thép không gỉ và mặt kính cường lực</p><p>Điện thoại iPhone Xs Max sở hữu lối thiết kế vô cùng đẹp mắt với những đường cong mềm mại được thừa hưởng từ chiếc iPhone đời trước đó.</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/190321/iphone-xs-max-gold-5.jpg\" alt=\"\"><p>Tuy nhiên, iPhone Xs Max lại có một thân hình to bản ngang bằng với kích thước dòng Plus nhưng chứa đựng một màn hình rộng lớn lên đến 6.5 inch.</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/190321/iphone-xs-max-gold-10.jpg\" alt=\"\"><p>Nhờ thế mà bạn sẽ có một không gian trải nghiệm vô cùng rộng rãi để thưởng thức những bộ phim chất lượng cao được trở nên trọn vẹn.</p><img src=\"https://cdn.tgdd.vn/Products/Images/42/190321/iphone-xs-max-gold-1.jpg\" alt=\"\"></div>",
      "shortDescription": "<div><p>Hoàn toàn xứng đáng với những gì được mong chờ, phiên bản cao cấp nhất iPhone Xs Max 64 GB của Apple năm nay nổi bật với chip A12 Bionic mạnh mẽ, màn hình rộng đến 6.5 inch, cùng camera kép trí tuệ nhân tạo và Face ID được nâng cấp.</p></div>",
      "id": 5,
      "isHidden": true
    }
  ],
  "profile": {
    "name": "typicode"
  }
}